docker/ruby/srcs/server/app/controllers/friends_controller.rb

INSERT INTO "friends" ("user_one_id", "user_two_id", "created_at", "updated_at", "pending") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_one_id", 1], ["user_two_id", 2], ["created_at", "2021-04-17 08:22:17.686744"], ["updated_at", "2021-04-17 08:22:17.686744"], ["pending", true]]
---
  def create
    if !friendship_exists(params[:user_one_id], params[:user_two_id]) \
    && params[:user_one_id] != params[:user_two_id]
      @friend = Friend.new(friend_params)
      if @friend.save

UPDATE "friends" SET "user_one_id" = $1, "user_two_id" = $2, "updated_at" = $3, "pending" = $4 WHERE "friends"."id" = $5  [["user_one_id", 5], ["user_two_id", 4], ["updated_at", "2021-04-18 11:38:47.399607"], ["pending", false], ["id", 35]]
---
  def update
    if @friend.update(friend_params)

SELECT "friends".* FROM "friends" WHERE "friends"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
    def friendship_exists(user_1, user_2)
      if (!Friend.where(user_one_id: user_1, user_two_id: user_2).empty? \
      || !Friend.where(user_one_id: user_2, user_two_id: user_1).empty?)