docker/ruby/srcs/server/app/controllers/users_controller.rb

  def block_user
    if (user = User.find_by_id(params[:user][:id]))
      if !is_blocked(current_user, user.id) \
      && current_user != user
        current_user.block_list.push(user.id)
        if current_user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "block_list" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-04-17 09:51:44.808566"], ["block_list", "{1}"], ["id", 2]]

  def unblock_user
    if (user = User.find_by_id(params[:user][:id]))
      if is_blocked(current_user, user.id)
        current_user.block_list.delete(user.id)
        if current_user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "block_list" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-04-17 09:56:21.754826"], ["block_list", "{}"], ["id", 2]]