docker/ruby/srcs/server/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def load_entities
    @users = User.all
    @user = User.find(params[:id]) if params[:id]