docker/ruby/srcs/server/app/views/chatrooms/_chatrooms.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <td><%= link_to chatroom_path(chatroom), class: "tab-content-list-option-link" do %><div class="tab-content-list-option"><%= chatroom.name %></div><% end %></td>
                <td><%= link_to User.find(chatroom.owner), class: "tab-content-list-option-link" do %><div class="tab-content-list-option"><%= User.find(chatroom.owner).username %></div><% end %></td>